app/Controllers/Admin.php

    public function dashboard(): string
    {
        $this->session->regenerate();

        if (!$this->sessionStatus) {
            return view('Login/index', ['erro' => 'você precisa está logado']);
        }

        $usuariosInfoGeral = $this->usuarioModel->findAll();
---
SELECT *
FROM `Usuarios`